Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
odule.sbeacon.module.docker_image_submitDataset_lambda.data.aws_caller_identity.this: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-getEntryTypes.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getIndividuals.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-admin.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-getInfo.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getInfo.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getEntryTypes.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.python_modules_layer.data.aws_region.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-admin.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-submitDataset.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.python_modules_layer.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getDatasets.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-splitQuery.data.aws_region.current: Reading...
module.sbeacon.data.aws_caller_identity.this: Reading...
module.sbeacon.module.lambda-admin.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-data-portal.data.aws_region.current: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-performQuery.data.aws_region.current: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-performQuery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.data.aws_caller_identity.this: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-generateReports.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.lambda-submitDataset: Reading...
module.sbeacon.data.aws_ecr_authorization_token.token: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getInfo.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-submitDataset: Read complete after 0s [id=4273650825]
module.sbeacon.module.lambda-data-portal.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_region.current: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-splitQuery.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getInfo.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.glue: Reading...
module.sbeacon.module.lambda-getProjects.data.aws_region.current: Reading...
module.sbeacon.data.aws_iam_policy_document.sagemaker_jupyter_instance_policy: Reading...
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_region.current: Reading...
module.sbeacon.data.aws_iam_policy_document.sagemaker_jupyter_instance_policy: Read complete after 0s [id=1147345228]
module.sbeacon.module.lambda-getBiosamples.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getFilteringTerms.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-generateCohortVCfs.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.data.aws_iam_policy_document.glue: Read complete after 0s [id=2681768870]
module.sbeacon.module.lambda-getProjects.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getConfiguration.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getRuns.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_region.current: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-getRuns.data.aws_region.current: Reading...
module.sbeacon.data.aws_iam_policy.AWSGlueServiceRole: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-performQuery.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-deidentifyFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-getEntryTypes.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.data.aws_iam_policy_document.main-apigateway: Reading...
module.sbeacon.module.lambda-updateFiles.data.aws_region.current: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-updateFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.data.aws_iam_policy_document.main-apigateway: Read complete after 0s [id=2699642182]
module.sbeacon.module.python_modules_layer.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getGenomicVariants.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-getMap.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-generateReports.data.aws_region.current: Reading...
module.sbeacon.data.aws_ecr_authorization_token.token: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.python_modules_layer.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getGenomicVariants.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-generateReports.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getAnalyses.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_region.current: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_partition.current: Reading...
module.sbeacon.module.lambda-data-portal.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getConfiguration.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.sbeacon.module.lambda-getMap.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.data.aws_iam_policy_document.ec2_assume_role_policy: Reading...
module.sbeacon.module.lambda-getAnalyses.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getAnalyses.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-getInfo.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-indexer.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.ec2_assume_role_policy: Read complete after 0s [id=2851119427]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-indexer.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-getFilteringTerms.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-deidentifyFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-getInfo.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.sbeacon.module.lambda-getRuns.data.aws_caller_identity.current: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_partition.current: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-performQuery: Reading...
module.sbeacon.module.lambda-getBiosamples.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.data.aws_iam_policy_document.lambda-performQuery: Read complete after 0s [id=3620005588]
module.cognito.data.aws_caller_identity.this: Reading...
module.sbeacon.module.lambda-getRuns.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.data.aws_iam_policy_document.admin_group_role_policy: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_region.current: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated_role_policy: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.data.aws_iam_policy_document.admin_group_role_policy: Read complete after 0s [id=1269268040]
module.cognito.module.lambda-logEmailDelivery.data.aws_partition.current: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_authenticated_role_policy: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_partition.current: Reading...
module.cognito.data.aws_iam_policy_document.manager_group_role_policy: Reading...
module.cognito.data.aws_caller_identity.this: Read complete after 0s [id=307946671795]
module.cognito.module.lambda-sendClinicJobEmail.data.aws_caller_identity.current: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated_role_policy: Read complete after 0s [id=456311145]
module.cognito.data.aws_iam_policy_document.manager_group_role_policy: Read complete after 0s [id=2117676676]
module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.data.aws_iam_policy_document.gaspi_authenticated_role_policy: Read complete after 0s [id=2449066735]
module.cognito.module.lambda-sendClinicJobEmail.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.cognito.module.lambda-sendClinicJobEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_region.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_caller_identity.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_partition.current: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_region.current: Reading...
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_partition.current: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_caller_identity.current: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_caller_identity.current: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.module.lambda-sendClinicJobEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_partition.current: Read complete after 0s [id=aws]
module.cognito.data.aws_ses_email_identity.ses_source_email: Reading...
module.cognito.module.lambda-sendRegistrationEmail.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_region.current: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-logEmailDelivery.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.cognito.module.lambda-customMessageLambdaTrigger.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.cognito.module.lambda-sendClinicJobEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.cognito.module.lambda-sendRegistrationEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-queryVCF.data.aws_region.current: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.cognito.data.aws_ses_email_identity.ses_source_email: Read complete after 0s [id=dian.larasaty@xapiens.id]
module.svep[0].module.lambda-concatStarter.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-concatStarter.data.aws_region.current: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_caller_identity.this: Reading...
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_caller_identity.this: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-createPages.data.aws_partition.current: Reading...
module.svep[0].module.lambda-createPages.data.aws_caller_identity.current: Reading...
module.svep[0].module.python_modules_layer.data.aws_region.current: Reading...
module.svep[0].module.lambda-createPages.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.python_modules_layer.data.aws_partition.current: Reading...
module.svep[0].module.lambda-createPages.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.python_modules_layer.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_partition.current: Reading...
module.svep[0].module.python_modules_layer.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_region.current: Reading...
module.svep[0].module.docker_image_pluginConsequence_lambda.data.aws_caller_identity.this: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-queryVCF.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_partition.current: Reading...
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_partition.current: Reading...
module.svep[0].module.docker_image_pluginConsequence_lambda.data.aws_caller_identity.this: Read complete after 0s [id=307946671795]
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_region.current: Reading...
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-queryVCF.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginGnomad.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginConsequence.data.aws_partition.current: Reading...
module.svep[0].module.docker_image_qcFigures_lambda.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginGnomad.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginConsequence.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginGnomad.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_partition.current: Reading...
module.svep[0].module.lambda-createPages.data.aws_region.current: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_region.current: Reading...
module.svep[0].module.lambda-createPages.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-sendJobEmail.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-queryVCF.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-sendJobEmail.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-concatStarter.data.aws_partition.current: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_partition.current: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-concatStarter.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginConsequence.data.aws_region.current: Reading...
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-formatOutput.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginConsequence.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.docker_image_pluginConsequence_lambda.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_region.current: Reading...
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-formatOutput.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-qcFigures.data.aws_partition.current: Reading...
module.svep[0].module.docker_image_pluginConsequence_lambda.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-qcFigures.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-pluginConsequence.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-formatOutput.data.aws_caller_identity.current: Reading...
module.svep[0].module.python_modules_layer.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-concat.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_region.current: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_region.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-qcFigures.data.aws_caller_identity.current: Reading...
module.svep[0].module.python_modules_layer.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-concatPages.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-qcFigures.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-concat.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-concatPages.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-qcFigures.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-concat.data.aws_region.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_partition.current: Reading...
module.svep[0].module.lambda-qcNotes.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-concat.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-qcNotes.data.aws_region.current: Reading...
module.svep[0].module.lambda-concat.data.aws_partition.current: Reading...
module.svep[0].module.lambda-concatPages.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-pluginClinvar.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_region.current: Reading...
module.svep[0].module.lambda-qcNotes.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-concat.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-qcNotes.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-pluginClinvar.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-pluginClinvar.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginClinvar.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-qcNotes.data.aws_partition.current: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_region.current: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_region.current: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-qcNotes.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-queryGTF.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-getResultsURL.data.aws_region.current: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-initQuery.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-queryGTF.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_region.current: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-getResultsURL.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-initQuery.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_region.current: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_partition.current: Reading...
module.svep[0].module.lambda-initQuery.data.aws_caller_identity.current: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_partition.current: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_partition.current: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_region.current: Read complete after 0s [id=ap-southeast-3]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-getResultsURL.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_partition.current: Read complete after 0s [id=aws]
module.svep[0].module.lambda-initQuery.data.aws_partition.current: Reading...
module.svep[0].module.lambda-initQuery.data.aws_caller_identity.current: Read complete after 0s [id=307946671795]
module.svep[0].module.lambda-initQuery.data.aws_partition.current: Read complete after 0s [id=aws]
module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-performQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.sbeacon.module.lambda-performQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.security.module.lambda-sendSecurityAlert.data.aws_iam_policy_document.assume_role[0]: Reading...
module.security.module.lambda-sendSecurityAlert.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Reading...
module.security.data.aws_iam_policy_document.lambda-sendSecurityAlert: Read complete after 0s [id=1831009318]
module.webgui.data.aws_cloudfront_cache_policy.bui-s3-distribution-cache-policy: Read complete after 2s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-concatStarter.data.external.archive[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.external.archive[0]: Reading...
module.svep[0].module.lambda-deleteClinicalWorkflow.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginGnomad.data.external.archive[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.external.archive_prepare[0]: Reading...
module.sbeacon.data.aws_iam_policy.AWSGlueServiceRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole]
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.external.archive[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-createPages.data.external.archive[0]: Reading...
module.svep[0].module.python_modules_layer.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-formatOutput.data.external.archive[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-queryVCF.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-concatStarter.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-pluginGnomad.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-createPages.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-pluginGnomadConstraint.data.external.archive[0]: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-concatPages.data.external.archive[0]: Reading...
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-concat.data.external.archive[0]: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-qcNotes.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-getResultsURL.data.external.archive[0]: Reading...
module.svep[0].module.lambda-pluginClinvar.data.external.archive[0]: Reading...
module.svep[0].module.lambda-deleteClinicalWorkflow.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginGnomadOneKG.data.external.archive[0]: Reading...
module.svep[0].module.python_modules_layer.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-queryGTF.data.external.archive[0]: Reading...
module.svep[0].module.lambda-concatPages.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-queryVCFsubmit.data.external.archive[0]: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-clearTempAndRegions.data.external.archive_prepare[0]: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-concat.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-pluginClinvar.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-initQuery.data.external.archive[0]: Reading...
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-getResultsURL.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-updateReferenceFiles.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.svep[0].module.lambda-initQuery.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-queryGTF.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-queryVCFsubmit.data.external.archive[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-qcNotes.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-clearTempAndRegions.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-deleteClinicalWorkflow.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-createPages.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=472632835]
module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginGnomadConstraint.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3543757487]
module.svep[0].module.lambda-formatOutput.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4105360626]
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-sendJobEmail.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3280561603]
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatStarter.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1873196561]
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-pluginGnomad.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1890644179]
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-concatPages.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1087810284]
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-qcNotes.data.aws_iam_policy_document.assume_role[0]: Reading...
module.svep[0].module.lambda-queryVCF.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1254668656]
module.svep[0].module.lambda-concat.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3802164963]
module.svep[0].module.lambda-pluginClinvar.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1631554632]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-qcNotes.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0]: Reading...
module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-clearTempAndRegions.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.svep[0].module.lambda-getResultsURL.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4110298452]
module.svep[0].module.lambda-queryGTF.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2780603524]
module.svep[0].module.lambda-queryVCFsubmit.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=70293401]
module.svep[0].module.lambda-pluginGnomadOneKG.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=192549767]
module.svep[0].module.lambda-initQuery.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2384263395]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_backup_plan.gaspi_backup_plan will be created
  + resource "aws_backup_plan" "gaspi_backup_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "gaspi_backup_plan"
      + region   = "ap-southeast-3"
      + tags     = {
          + "Environment" = "dev"
          + "Owner"       = "gaspi"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Owner"       = "gaspi"
        }
      + version  = (known after apply)

      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "weekly"
          + schedule                     = "cron(0 20 ? * SUN *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 30
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "yearly"
          + schedule                     = "cron(0 22 1 1 ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 3650
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "monthly"
          + schedule                     = "cron(0 21 1 * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 365
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "daily"
          + schedule                     = "cron(0 19 * * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 7
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
    }

  # aws_backup_selection.gaspi_backup_selection will be created
  + resource "aws_backup_selection" "gaspi_backup_selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "gaspi_backup_resource_selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)
      + region        = "ap-southeast-3"

      + condition (known after apply)

      + selection_tag {
          + key   = "backup"
          + type  = "STRINGEQUALS"
          + value = "true"
        }
    }

  # aws_iam_role.gaspi_backup_role will be created
  + resource "aws_iam_role" "gaspi_backup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_backup_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.gaspi_backup_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_backup_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Backup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_restore_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_restore_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Restore"
      + role       = "gaspi_backup_role"
    }

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendClinicJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendClinicJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:307946671795:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:307946671795:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendRegistrationEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendRegistrationEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:307946671795:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:307946671795:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "307946671795",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be created
  + resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
      + allow_classic_flow               = false
      + allow_unauthenticated_identities = false
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "gaspi-users"
      + region                           = "ap-southeast-3"
      + tags                             = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                         = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "gaspi_cognito_roles" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + region           = "ap-southeast-3"
      + roles            = (known after apply)

      + role_mapping {
          + ambiguous_role_resolution = "AuthenticatedRole"
          + identity_provider         = (known after apply)
          + type                      = "Token"
        }
    }

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "ap-southeast-3"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + region                = "ap-southeast-3"
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_group.admin_group will be created
  + resource "aws_cognito_user_group" "admin_group" {
      + description  = "Group of users who can has admin privileges"
      + id           = (known after apply)
      + name         = "administrators"
      + precedence   = 1
      + region       = "ap-southeast-3"
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_group.manager_group will be created
  + resource "aws_cognito_user_group" "manager_group" {
      + description  = "Group of users who can has management privileges"
      + id           = (known after apply)
      + name         = "managers"
      + precedence   = 2
      + region       = "ap-southeast-3"
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + region       = "ap-southeast-3"
      + user_pool_id = (known after apply)
      + username     = "admin@example.com"
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be created
  + resource "aws_cognito_user_pool" "gaspi_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OPTIONAL"
      + name                       = "gaspi-users"
      + region                     = "ap-southeast-3"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + user_pool_tier             = (known after apply)

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + email_configuration {
          + configuration_set     = "ses-feedback-config"
          + email_sending_account = "DEVELOPER"
          + from_email_address    = "dian.larasaty@xapiens.id"
          + source_arn            = "arn:aws:ses:ap-southeast-3:307946671795:identity/dian.larasaty@xapiens.id"
        }

      + lambda_config {
          + custom_message       = (known after apply)
          + pre_token_generation = (known after apply)

          + pre_token_generation_config (known after apply)
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "terraform"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "is_medical_director"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + software_token_mfa_configuration {
          + enabled = true
        }

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client will be created
  + resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
      + access_token_validity                         = 5
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = 3
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = 5
      + logout_urls                                   = (known after apply)
      + name                                          = "gaspi-users-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 2
      + region                                        = "ap-southeast-3"
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "minutes"
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.